[
{"site": "CITY A.M.", "headlines": "US Supreme Court judge Ruth Bader Ginsburg dies of cancer aged 87", "dates": "09/20/2020", "links": "https://www.cityam.com/us-supreme-court-judge-ruth-bader-ginsburg-dies-of-cancer-aged-87/", "content": "US Supreme Court Justice Ruth Bader Ginsburg died of cancer at the age of 87, the court has said. Ginsburg passed away at her home in Washington on Friday, surrounded by her family, following a battle with metastatic pancreatic cancer, the statement said. She was the oldest justice and just second woman to ever sit on the Supreme Court, having been appointed in 1993. The prominent feminist and figurehead for liberals revealed she was undergoing chemotherapy earlier this year, following a recurrence of cancer. “Our Nation has lost a jurist of historic stature,” Chief Justice John Roberts said in a statement on Friday. “We at the Supreme Court have lost a cherished colleague. Today we mourn, but with confidence that future generations will remember Ruth Bader Ginsburg as we knew her – a tireless and resolute champion of justice.” Ginsburg was one of four liberals on the justice court. Her death raises the possibility of US President Donald Trump trying to expand the slender conservative majority on the court ahead of November’s election. He is expected to appoint nominate a conservative replacement as soon as possible. Presidential candidate Joe Biden has said the appointment should be made after the US election. And Ginsburg expressed her strong disapproval of Trump making such a move in the days before her death. “My most fervent wish is that I will not be replaced until a new president is installed,” she wrote in a statement to her granddaughter,  . Reacting to the news of Ginsburg’s death following a rally in Minnesota, Trump said: “I didn’t know that. She led an amazing life, what else can you say?” He later tweeted a statement, calling her a “titan of law” and a “brilliant mind”. Statement from the President on the Passing of Supreme Court Associate Justice Ruth Bader Ginsburg "},
{"site": "CITY A.M.", "headlines": "Coronavirus: Johnson faces calls for urgent action and COBRA meeting", "dates": "09/20/2020", "links": "https://www.cityam.com/coronavirus-johnson-faces-calls-for-urgent-action-and-cobra-meeting-as-cases-rise/", "content": "Prime Minister Boris Johnson has come under pressure to take “decisive action” in the battle against coronavirus as cases rise. Scottish First Minister Nicola Sturgeon has demanded a COBRA meeting within the next 48 hours and echoed the sentiments of London mayor Sadiq Khan regarding the need to learn from March’s mistakes and implement restrictions quickly. “We know from experience earlier in the year that speed and decisiveness of action is important in the fight against COVID,” Sturgeon tweeted. Scotland reported 350 new cases on Saturday and three deaths, while England saw 16 more deaths. Sturgeon said: “There will always be fluctuations in daily figures – that’s why we look at 7 day averages to balance out variations in testing etc. Even with that caveat though, today’s report underlines [the] fact that COVID is rising.” She said the Scottish government “will seek to reach considered decisions as quickly as possible” and urged the public to be “extra careful” and “minimise interactions with other households”. It comes after Khan yesterday warned that London risked coronavirus cases “spiralling out of control” as they did earlier in the year. He said it was “increasingly likely” lockdown measures would be needed in London again. Earlier today, Dr Bharat Pankhania, senior clinical lecturer at the University of Exeter, told Sky News it is “blindingly obvious” what needs to be done to stem the increase in Covid-19 cases. He said: “My advice to Prime Minister Boris Johnson is, don’t sit there and say ‘we are going to do something next week’. It’s tomorrow, it’s today. “You say, ‘as of today please reduce your circulation in pubs, restaurants, transport, offices and all those places where infection transmits’. It’s as straightforward as that.” According to the government’s scientific advisers, the R number, which shows the spread of the virus, is now between 1.1 and 1.4. It has led to fears the number of cases in a few weeks could equal those seen in March and April if decisive action is not taken now."},
{"site": "CITY A.M.", "headlines": "Trump predicts Covid-19 vaccine to be available to every American by April", "dates": "09/20/2020", "links": "https://www.cityam.com/trump-predicts-covid-19-vaccine-to-be-available-to-every-american-by-april/", "content": "US President Donald Trump has said he expects a vaccine for coronavirus to be available for every American by April. Speaking at a news conference on Friday, Trump told reporters he was optimistic of the vaccine being available in just seven months time and that it would be distributed within 24 hours of federal approval. “Hundreds of millions of doses will be available every month, and we expect to have enough vaccines for every American by April,” Trump said. “In a short time we’ll have a safe and effective vaccine and we’ll defeat the virus,” he added. It comes at some odds with the US government scientists’ forecast, with Trump repeatedly clashing with health officials over Covid-19. He said he agreed with Dr Robert Redfield’s assessment that a vaccine will be widely available some time between April and September, but that he also thought it could be much earlier than that. When questioned if he knew more than Redfield, who is the director of the Centers for Disease Control and Prevention, he said: “In many cases I do.” Trump had previously suggested a vaccine could be approved in October, although that timeline looks increasingly ambitious with experts saying it is unlikely. The current US President, who is bidding to stay in office come November’s election, has also suggested reducing the number of coronavirus tests carried out would lower the overall case count and in turn encourage people to return to work and reopen the economy. It’s an approach opposed by public health officials. On Friday, a further 47,486 people in the US tested positive for the disease, according to Covid Tracking Project data, while the national death toll rose by 901."},
{"site": "CITY A.M.", "headlines": "London lockdown restrictions 'increasingly likely', warns Sadiq Khan", "dates": "09/20/2020", "links": "https://www.cityam.com/coronavirus-new-london-lockdown-restrictions-increasingly-likely-while-pm-warns-of-second-wave-across-uk/", "content": "London mayor Sadiq Khan has said he does not want to wait for coronavirus cases “to spiral out of control again” before further lockdown measures are introduced in the capital. Khan said it was looking “increasingly likely” that more restrictions would be needed as has been seen in other parts of the country.  Sadiq Khan said: “The prime minister has said that we are now seeing the start of a second wave of Covid-19 across the UK. “Londoners should also know that I am extremely concerned by the latest evidence I’ve seen today from public health experts about the accelerating speed at which COVID-19 is now spreading here in London. “This is made worse by the uncertainty caused by the lack of testing capacity in the capital. This afternoon I held an emergency meeting with London council leaders, the government and Public Health England to discuss the next steps. “It is increasingly likely that, in London, additional measures will soon be required to slow the spread of the virus. We will be considering some of the measures which have already been imposed in other parts of the UK. “I am of the firm view that we should not wait, as happened six months ago, for this virus to again spiral out of control before taking action. “The best thing for both public health and the economy is new restrictions imposed early, rather than a full lockdown when it’s too late – but the government must urgently ensure there is a fully functioning testing system. “I strongly urge all Londoners to be as cautious as possible over this weekend. Please think very carefully about your actions – strictly follow social distancing rules, regularly wash your hands and wear a face covering to help reduce the spread of the virus.” The London mayor’s comments came after Prime Minsiter Boris Johnson warned of an “inevitable second wave” of Covid-19 on Friday as 4,322 new cases of coronavirus were confirmed – the highest since 8 May. “Clearly when you look at what is happening, you’ve got to wonder whether we need to go further than the rule of six that we brought in,” he said. Johnson said the government would keep “everything under review” but a second national lockdown was “the last thing anybody wants”. “We want to keep schools open,” he said. “We want to keep the economy open as far as we possibly can, we want to keep businesses going.” He added: “The only way we can do that is, obviously, if people follow the guidance.”"},
{"site": "CITY A.M.", "headlines": "FTSE 100 and US stocks slip amid rising Covid cases", "dates": "09/20/2020", "links": "https://www.cityam.com/ftse-100-slips-as-investors-weigh-up-economic-recovery/", "content": "The FTSE 100 and US stocks slipped as investors weighed up rising coronavirus cases and the latest decisions by the Bank of England and US Federal Reserve. London’s main stock index fell 0.5 per cent to 6,017 points at 3pm. Mid-cap firms were hit harder, with the FTSE 250 dropping one per cent. On Wall Street, the Nasdaq index slipped 0.1 per cent, continuing a now three-day decline in big tech stocks. The S&P 500 fell 0.3 per cent and the Dow Jones was down 0.4 per cent. Europe’s continent-wide Stoxx 600 rose 0.4 per cent, however. Germany’s Dax was down 0.1 per cent and the French CAC 40 had fallen 0.9 per cent. The downward shift came as investors digested the resurgence of coronavirus around the world. Global cases topped 30m yesterday. And countries from France to South Korea are frantically fighting the virus they once thought they had under control. Investors have also been left somewhat disappointed by the US Federal Reserve, which did not signal any further easing on Wednesday. For the moment, the global economic recovery is still faring well.   investors today digested data that showed   again in August, and now stand four per cent higher than before Covid. Yet the potential for further lockdowns hammered travel stocks. Health secretary Matt Hancock today said he did not rule out another lockdown, although he said it was not being planned. British Airways-owner IAG was the biggest faller on the FTSE 100, plunging 11.6 per cent. Jet engine-maker Rolls Royce shed 4.4 per cent and Intercontinental Hotels fell 4.5 per cent. “Amid growing chatter about a potential two-week nationwide lockdown in October in the UK, it was perhaps no surprise to see investors lose interest in stocks that could be negatively affected by such activity,” said Russ Mould, investment director at broker AJ Bell. UK banks also took a hit after the Bank of England yesterday said it was working out how it would implement negative interest rates should they be needed. Lower interest rates damage banks’ profitability. The FTSE 350 banks index slumped to its lowest level in almost three decades. Investors have dumped bank stocks, worried about coronavirus loans to companies and record-low interest rates. The pound was down 0.2 per cent against the dollar at $1.295. It has had a volatile few weeks as Brexit has returned to the headlines. It was not all bad on the FTSE 100, however. The rise in retail sales in August helped Sainsbury’s shares climb 2.1 per cent and Tesco’s rise one per cent. Wall Street has had a torrid three weeks after investors second-guessed the recent stellar rally in tech stocks and hit the sell button. Investors were left underwhelmed by the US Federal Reserve meeting on Wednesday, after chair Jay Powell did not signal any more stimulus was imminent. Stocks sold off despite the Fed improving its economic forecasts for the US. Also on traders’ minds is the lack of progress between Republicans and Democrats over the next round of fiscal stimulus. “What’s more, tech stocks – which were a driving force behind the outstanding stock market comeback – remain shaky and vulnerable to more downside,” said Craig Erlam, senior market analyst at currency firm Oanda."},
{"site": "CITY A.M.", "headlines": "HMRC to receive powers to enforce disclosure of assets", "dates": "09/20/2020", "links": "https://www.cityam.com/hmrc-to-receive-powers-to-enforce-disclosure-of-assets/", "content": "HM Revenue & Customs (HMRC) will be given new powers that will allow it to force financial institutions to provide information about people’s assets. The firms will be required to pass on customer information if served with a “financial institution notice” by HMRC under new measures proposed in the next finance bill. It will mean a court or the individual’s approval is no longer required. Currently consent is provided by the individual or a tax tribunal must approve the request. The financial institutions covered include banks, investment advisers, fund managers, credit unions, insurance companies and credit card issuers. The government’s proposal could come into effect as soon as next year. The thinking behind the idea is that it will make it quicker and easier for HMRC to share information with foreign tax authorities as part of a global crackdown on tax evasion. However, the move has caused concern in some quarters. The Chartered Institute of Taxation said it was “concerned about the loss of independent tribunal oversight, particularly in cases which involve requests for information about UK taxpayers”. Meanwhile, UK Finance said the measures signified a “watering down [of] safeguards”. HMRC said it was important in the battle against tax evasion and avoidance and would help them deal with it in “an appropriate and effective way”. “The new notice will contain numerous safeguards for taxpayers, in line with practice in all other G20 countries, and the power can only be used in specific circumstances where the information is reasonably required for the purposes of checking a taxpayer’s tax position,” the tax authority said."},
{"site": "CITY A.M.", "headlines": "Global stocks slip as coronavirus cases rise", "dates": "09/20/2020", "links": "https://www.cityam.com/global-stocks-slip-as-coronavirus-cases-rise/", "content": "Stock markets around the world continued to stutter this week as an increase in Covid-19 cases in across Europe weighed on market sentiment. Wall Street saw early gains on Friday reverse and the S&P 500 and Nasdaq ended the session posting a third straight week of declines, led by this week’s Federal Reserve meeting and coronavirus outbreaks across Europe. The S&P 500 lost 37 points, or 1.12 per cent, to 3,319, ending the week 0.65 per cent down. Meanwhile the Nasdaq dropped 117 points, or 1.07 per cent, to 10,793, declining 0.56 per cent for the week, as tech firms led equities lower. The Dow Jones also fell on Friday, losing 244 points, or 0.88 per cent, to 27,657, while the dollar posted its fifth straight day of declines against the yen. In the UK, the FTSE 100 and FTSE 250 both shed 0.7 and 1.0 per cent respectively, ending the week relatively flat. It comes as the country introduced new coronavirus restrictions in multiple regions and considers a second national lockdown. In Europe, where outbreaks have also continued and caused further lockdown measures to be introduced, France’s Cac 40 finished Friday 1.22 per cent down, while the German Dax slipped 0.77 per cent. Meanwhile, oil prices remained steady for the week, with Brent crude futures finishing at $43.15 a barrel. Gold posted more gains to finish at 1,957 per ounce as investors turned to safe havens again."},
{"site": "CITY A.M.", "headlines": "Just 6 per cent of UK population has Covid-19 antibodies, SAGE says", "dates": "09/20/2020", "links": "https://www.cityam.com/just-6-per-cent-of-uk-population-has-covid-19-antibodies-sage-says/", "content": "Only six per cent of the UK’s population has antibodies to Covid-19, minutes from a Scientific Advisory Group for Emergencies (SAGE) meeting earlier this month have revealed. The scientific advisers told the government that just a small proportion of the country had antibodies to coronavirus in the meeting. SAGE also informed officials that there was evidence that these levels may reduce over the preceding months, while some types of antibody may allow a transmissible amount of the virus to be present still. “Evidence from serology studies suggest a small proportion (around 6%) of the UK population has antibodies to COVID-19,” according to the SAGE minutes from 3 September. “There is evidence of antibody levels waning over 2-3 months (medium confidence),” it said. “There is evidence that individuals with certain types and levels of antibody can still have significant viral load and potentially transmit the virus (high confidence).” SAGE went on to warn that the current levels of immunity among the population would be unlikely to mitigate the impact of “a significant winter resurgence”. More than 4,000 new coronavirus cases were confirmed on Friday – the biggest daily increase since 8 May. The government has already introduced local lockdown measures in regions across the UK and Prime Minister Boris Johnson has warned of a second wave being “inevitable”. London mayor Sadiq Khan has also urged for restrictions to be implemented again in the capital before cases “surge out of control” as they did the first time around."},
{"site": "CITY A.M.", "headlines": "BoE reaction: Will interest rates go negative?", "dates": "09/20/2020", "links": "https://www.cityam.com/bank-of-england-reaction-will-interest-rates-go-negative/", "content": "The Bank of England (BoE) held monetary policy steady yesterday for the second meeting in a row. Interest rates were left at 0.1 per cent and bond-buying at £745bn in a business-as-usual decision. All nine members of the monetary policy committee (MPC) voted in favour of continuing this monetary policy. But analysts, investors and traders continued to hotly debate how the Bank will proceed in the coming months.   The Bank was relatively upbeat about the economy, saying the recovery had been “a little stronger” than expected. However, it warned that coronavirus could knock it off course. Most of the talk after yesterday’s decision was about negative interest rates. The meeting’s minutes showed that the MPC discussed how they could be implemented, should the economy need them. They also said the BoE will begin “structured engagement” with the Prudential Regulation Authority (PRA) on “policy considerations” in the fourth quarter. Here’s what economists and analysts made of the Bank’s latest meeting. The pound slid yesterday after the meeting’s minutes showed that the Bank was taking the possibility of negative interest rates relatively seriously. However, chief UK economist at Oxford Economics Andrew Goodwin said, the “structured engagement” with the PRA was nothing more than a formality. “That the BoE is merely beginning to consult on the implications of negative rates confirms this is not an active policy option in the near-term,” he said.  Yet Nigel Green, founder and chief executive of De Vere Group, took the minutes more seriously. He said that personal financial strategies should be reviewed to ensure they are “negative interest rate ready”. “This would have been unimaginable even a few months ago. But the shifts have been seismic this year.” Andrew Wishart, UK economist at consultancy Capital Economics, expected quantitative easing (QE) to “remain the tool of choice” for months ahead. Under QE, the Bank creates money and buys government and corporate bonds to keep borrowing costs low. “The Bank will only start working out how to put negative rates into practice in the fourth quarter,” he said. “And even then it will remain concerned about their effectiveness when banks are absorbing loan losses.” The   its fast data had shown the UK’s economic recovery was stronger than it had predicted in August. “Consumption has continued to recover during the summer and is now at around its start-of-year level in aggregate,” it said. Jacqui Douglas, macro strategist at TD Securities, said the statement was “more upbeat than we had expected”. She said that reflected “a slightly stronger rebound into the third quarter”. Douglas also flagged that there was “no mention of the risks to growth into 2021, which is where some MPC members had expressed a lot more concern”. However, the Bank cautioned that the spread of Covid in the UK and Europe could knock the recovery off track. Howard Archer, chief economic adviser to the EY Item Club, said: “The members seemed wary of the downside risks to the recovery, stemming from rising coronavirus cases.” He pointed out that “the possibility of persistently high unemployment” was also one of the Bank’s worries. The Bank gave little indication that it plans to boost stimulus in November. But many analysts predict it will increase its bond-buying target as demand built up during lockdown peters out. Wishart said he predicted “more than the consensus expects”. He said: “We’ve pencilled in an extra £250bn of QE over the course of the next year, with an instalment of £100bn in November.” Pantheon Macroeconomics’ chief UK economist Samuel Tombs said: “Our view remains that the MPC will authorise a further £50bn of asset purchases before the end of this year, and then a further £50bn of purchases in the first quarter [of 2021].”"},
{"site": "CITY A.M.", "headlines": "Fortnight left until UK coronavirus crisis 'out of control', experts warn", "dates": "09/20/2020", "links": "https://www.cityam.com/only-a-fortnight-left-until-uk-coronavirus-crisis-out-of-control-experts-warn/", "content": "The UK only has two to three weeks to improve its Test and Trace scheme before the spread of coronavirus gets “out of control”, experts have warned today. The Independent Sage committee of scientists, chaired by former chief scientific adviser Sir David King, has issued a report to caution government of an upcoming crisis if it cannot get a handle on the infection rate. It recommended that the government take drastic measures to avoid a second national lockdown, such as the immediate suspension of indoor service in pubs and restaurants. Other emergency proposals included: The committee said a thousand of lives could be saved if the government can double the efficacy of the NHS Test and Trace scheme from 16 per cent to 32 per cent, but that it must happen immediately. Karl Friston, a neuroscientist at University College London, said current assumptions that the government has to reach 80 per cent of contacts for every infected person may be “fundamentally misguided”. “Dynamic causal modelling shows a simple doubling of contact tracing efficacy… would bend the curve — and save about 1,000 lives,” he said alongside the report’s release. Friston said the government should re-focus the Test and Trace scheme towards using local public health teams to find, monitor and support traced persons, rather than staffing remote call centres. “The headline from the quantitative modelling of recent trends in new cases is clear: now is the time for ‘shoe-leather’ epidemiology,” he said. “Crucially, this kind of contact tracing can only be done effectively using local knowledge (e.g. cultural aspects), expertise and detective work.” Friston added that such an approach would reduce the demand for tests, which could be better used for testing those without symptoms who have come into contact with a confirmed case. The report comes as the UK’s coronavirus testing infrastructure is reaching its breaking point, as thousands are left unable to book a test in their local area. Meanwhile the virus is now understood to be doubling every seven to eight days, with more than 3,300 new cases   yesterday."},
{"site": "CITY A.M.", "headlines": "Tiktok and Wechat US downloads to be banned from Sunday", "dates": "09/20/2020", "links": "https://www.cityam.com/tiktok-and-wechat-us-downloads-to-be-banned-from-sunday/", "content": "Downloads of popular video app Tiktok and Chinese messaging app Wechat will be banned in the US from Sunday, White House officials have said. However the ban on Tiktok could still be reversed if its owner Bytedance is able to get a deal to offload its ownership over the US service approved by US President Donald Trump. Bytedance has been in talks with software firm Oracle to give the company a minority stake and management of its US data by creating a new entity called Tiktok Global, in a bid to assuage national security concerns over its Chinese origins. US Commerce Department officials said they will not bar additional technical transactions for Tiktok until 12 November, allowing Bytedance additional time to secure a deal even after the ban takes effect. The Commerce Department order will “deplatform” the two apps, which are used by more than 100m people in the United States — meaning people that already have the apps can still use them but will not receive any new updates, and new downloads will be banned. Apple’s App Store, Alphabet’s Google Play and others will be prohibited from offering the apps on any platform “that can be reached from within the United States,” a senior Commerce official told Reuters. However those companies will still be allowed to offer the apps for download outside the US. US Commerce Department secretary Wilbur Ross said in a written statement: “We have taken significant action to combat China’s malicious collection of American citizens’ personal data, while promoting our national values, democratic rules-based norms, and aggressive enforcement of US laws and regulations.” Bytedance, Tiktok and Wechat have yet to respond to the order."},
{"site": "CITY A.M.", "headlines": "UK coronavirus ‘R’ rate rises to between 1.1 and 1.4", "dates": "09/20/2020", "links": "https://www.cityam.com/uk-coronavirus-r-rate-rises-to-between-1-1-and-1-4/", "content": "The UK’s Covid reproduction or “R” rate has risen to between 1.1 and 1.4, the government has said, in the latest evidence that coronavirus is spreading quickly again through the country. It was up from last week’s figures of between one and 1.2. The government said that the new R rate means “that on average every 10 people infected will infect between 11 and 14 other people”. The Government Office for Science (GOS) also said that coronavirus infections were growing by between two and seven per cent every day. It cautioned the figures should be seen only as “a guide to the general trend”. But the GOS and Scientific Advisory Group for Emergencies  : “There is widespread growth of the epidemic across the country.” The increase in the all-important reproduction rate is in line with the recent increase in cases in the UK. Daily cases have averaged over 3,000 over the last week, whereas they had dropped to below 1,000 in most of June and July. Yesterday, the UK reported 3,395 new cases, up from 1,735 two weeks earlier. In response to rising cases, the government has imposed new restrictions in parts of the north east, the north west and the midlands. Health secretary Matt Hancock said today that he could not rule out another nationwide lockdown. He said it was not currently being planned, however. The reproduction rate is the average number of infections produced by an infected person. For example, if R is two, then each infected person infects two more people. Keeping the R rate below one is crucial to controlling the pandemic. In England, the R rate was between 1.2 and 1.4, the government said. It was highest in the north west and the midlands, at between 1.2 and 1.5. The east of England had the lowest reproduction rate, at one to 1.3. London’s stood at 1.1 to 1.4."},
{"site": "CITY A.M.", "headlines": "Exclusive: Premier League Covid-19 testing firm raises $15m", "dates": "09/20/2020", "links": "https://www.cityam.com/exclusive-premier-league-covid-19-testing-firm-raises-15m-for-uk-rollout/", "content": "The company behind the Premier League’s coronavirus testing programme has raised $15m (£11.6m) in fresh funding as it eyes a UK rollout for its new rapid Covid-19 test. Biotech firm Prenetics said it will use the cash injection to advance its rapid testing technology, which promises results in 15 to 30 minutes. Prenetics played a key role in restarting the football season by providing tests for all 20 Premier League teams, and was chosen again as the sole testing partner for the new season. The company also runs testing for the British Boxing Board of Control and the England and Wales Cricket Board, as well as on film productions at Pinewood Studios. But Prenetics is now hoping to expand its test into more general use and is in talks with the governments in the UK and around the world about wider rollouts.  The Hong Kong-based firm will next month launch a pilot with Cathay Pacific and three other major airlines to trial airport testing. The testing could also be used in critical areas such as care homes and schools to help track and combat the spread of coronavirus. The funding round was led by London-based private equity firm Apis Partners, alongside existing investor Alibaba Hong Kong Entrepreneurs Fund. Prenetics chief executive Avi Lasarow told  the technology could provide the government with key data to help it adapt the UK’s coronavirus response. “We think that testing is akin to wearing a seatbelt in a car,” he said. “Without a doubt testing is going to play a major role in our everyday lives until such a time as a vaccine.” It comes as the government faces growing criticism over its testing system, with shortages forcing some Brits to travel hundreds of miles to get tested. Lasarow said the UK had built an effective centralised model for testing, but its reliance on laboratories had caused bottlenecks and limited scalability. “I think they’ve done a great job to get us where we are but their strategy needs to evolve to include the private sector,” he said. Prenetics said its new Covid-19 test was low-cost and did not require a laboratory. But Lasarow added that effective UK-wide testing would rely on a number of different technologies — including so-called digital health passports — coming together."},
{"site": "CITY A.M.", "headlines": "Queen strips Harvey Weinstein of honorary CBE", "dates": "09/20/2020", "links": "https://www.cityam.com/queen-strips-harvey-weinstein-of-honorary-cbe/", "content": "The Queen has stripped disgraced Hollywood film producer Harvey Weinstein of his honorary award after he was found guilty of sexual assault and rape.  Weinstein is serving a 23-year prison sentence in the US after he was convicted in February of sexually assaulting a former production assistant and raping an actress. He has appealed the conviction.  The Queen has today cancelled Weinstein’s honorary CBE. The decision was made at a meeting of the Honours Forfeiture Committee, which is independent from government. “The Queen has directed that the appointment of Harvey Weinstein to be an Honorary Commander of the Civil Division of the Most Excellent Order of the British Empire, dated 29 January 2004, shall be cancelled and annulled,” an official announcement said, according to Reuters. More than 100 women, including famous actresses, came forward to accuse Weinstein of sexual misconduct stretching back decades.  The allegations against Weinstein, which he has denied, kicked off the #MeToo movement.  At his trial earlier this year, prosecutors portrayed him as a serial predator who preyed upon women, manipulating them with promises of career advancement in Hollywood.  “The young struggling dreamers were not even people to him. He could take what he wanted knowing there was very little anyone could do about it,” Manhattan assistant district attorney Joan Illuzzi told the court. Weinstein said he was worried about the “thousands of men who are losing due process” during the #MeToo movement."}
]