[
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Outschool Raises $45M in Series B Funding", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/outschool-raises-45m-in-series-b-funding.html", "content": ", a San Francisco, CA-based  K-12 education marketplace, raised $45M in Series B funding.  The round was led by Lightspeed Venture Partners with participation from, Reach Capital, Union Square Ventures, SV Angel, FundersClub, Y Combinator and others.   The company intends to use the funds to accelerate hiring and product development for its K-12 education marketplace.  Led by Amir Nathoo, Co-founder and CEO, Outschool is an online marketplace of live, interactive classes that connect teachers and learners over real-time video in a small-group setting. Its offerings are created by independent teachers and include a wide variety of enrichment classes such as cooking, piano and language lessons as well as academic classes such as grammar bootcamps and geometry. Outschool classes are engaging and diverse with classes like: surviving a Zombie Apocalypse During the American Colonial Period, Ready, Set, Bake: Tasty Cupcakes, STEM Design: Build a Satellite, Grammar Detectives in the Rainforest, Bring Your Chickens to Class, and A Taste of Fashion Design . Classes on Outschool range from one-time enrichment lessons to semester-long core courses, are offered across all subjects, and for learners range from age 3 to 18.  18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Fixably Secures $2M in Funding", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/fixably-secures-2m-in-funding.html", "content": ", an Espoo, Finland-based provider of a software platform allowing repair shops and technicians to manage their workflow efficiently to get hardware fixed, secured $2M in funding. The round was led by Icebreaker.vc – the early stage venture capital fund operating in Finland, Estonia and Sweden.  The company intends to use the funds to accelerate their US expansion whilst increasing European and APAC presence. Launched in 2019 by Joel Mansnerus, CEO, Fixably provides a service management system specifically designed and developed for Apple Authorized Service Providers.  It integrates all tools needed to perform and follow-up repairs, handle internal resources and workflows, monetary transactions, logistics, customer communication, Apple requirements and more. The software is configurable and scales for all types and sizes of businesses, providing support for business proven processes.  Fixably, boasts rapid growth through customers in three different continents, creating a gross transactional value of more than $100M.  With over 1 million repairs completed so far in 2020, the company expects to increase this amount to 3 million repairs by the end of 2021.  Beyond this, the goal is to extend the life of one billion devices. 18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "dLocal Receives  $200M Investment; Achieves $1.2B Valuation", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/dlocal-receives-200m-investment-achieves-1-2b-valuation.html", "content": ", a Montevideo, Uruguay-based cross-border payment platform connecting global merchants to emerging markets, received up to $200m new investment.  The deal, which is subject to customary regulatory approvals, was led by existing investor General Atlantic, with participation from Addition. In conjunction with the funding, Luiz Ribeiro, Principal at General Atlantic, will join the dLocal Board of Directors.  Following the round, dLocal is now valued at $1.2 billion. The company intends to use the funds to accelerate global expansion, targeting 13 new markets over the next 18 months, including Central America, Africa, and Southeast Asia countries, and further build and refine its product set.  Founded in 2016 and led by Sebastián Kanovich, CEO, dLocal is a cross-border payment processor operating in Uruguay, India, Morocco, Nigeria, and South Africa.  Its API platform is designed to handle and facilitate mass online payments across Latin America, APAC, the Middle East, and Africa. By operating as a merchant’s local payments processor in each country, dLocal empowers global merchants to reach billions of customers, accept payments, send payouts, and settle funds globally.  The company has been profitable every year, achieving over 100% annual organic growth over the past four years and now serving 450 merchants in 20 countries, with connectivity to more than 300 alternative payment methods. Its global customers include Amazon, DiDi, Gearbest, Nike, Shopify, Spotify, Uber, Visa/Earthport, Zara, and many others. 18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Rebelstork Closes $2M Seed Funding Round", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/rebelstork-closes-2m-seed-funding-round.html", "content": ", a Toronto, Canada-based marketplace that allows the buying and selling of expert-curated quality baby gear, closed a $2M seed funding round.  The round was raised by a group of high net worth individuals.  The company intends to use the funds for the continued growth and scaling of the business.  Led by Emily Hosie, CEO and Founder, Rebelstork is a marketplace platform enabling the buying and selling of overstock, open box and quality used baby gear. The company’s proprietary pricing algorithm provides accurate and fair pricing for quality used goods based on a number of variables such as make, model, condition and market demand. Through the website, parents can schedule pickups of their outgrown goods, which are taken to the company’s Toronto facility to be quality checked and condition rated, photographed and listed.  Rebelstork is a certified pending B Corporation. 18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "WireBarley Raises $10M in Series B Funding", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/wirebarley-raises-10m-in-series-b-funding.html", "content": ", a Seoul, South Korea-based fintech startup specializing in global remittance services, raised $10m in Series B funding.   Backers included Magna Investment, Shinsegae I&C and Dt & Investment.  Led by CEO Joong-Won Yoo, WireBarley provides fully contactless financial services via its mobile app and web platform. The company is operating in 5 countries such as the US, Canada, Australia, South Korea, and New Zealand with 21 recipient countries. It has established a global network with 80 remittance corridors.  The company intends to use the funds to strengthen its global remittance service capabilities for individual customers and expand into the B2B field. In addition, regional expansion is on the way. Hong Kong will launch in October and more recipient countries including those in Europe and the Middle East will be added in the future. Furthermore, WireBarley will invest in developing and launching new products over the next few months such as the Multi-Currency Wallet services and additional banking services for North America.  The company gained more than 400,000 app downloads and accumulated well over than $400M in revenue to date.  18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Holidu Raises Over $4M from Kees Koolen", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/holidu-raises-over-4m-from-kees-koolen.html", "content": ", a Munich, Germany-based travel tech company, received an investment of more than €4m former Booking.com CEO Kees Koolen.  Koolen has invested into the company from his personal fund as part of a €5m extension to the €40m Series C round of the previous year. Founded by brothers Johannes and Michael Siebers in 2014,  Holidu provides a search engine for vacation rentals which allows travelers to book the ideal accommodation listed by Holidu’s 1,000+ partners worldwide. The company also provides holiday rental owners with a software and service solution under the   brand. This enables owners to increase their bookings by distributing properties to the largest travel websites, synchronizing calendars, and creating multilingual descriptions and professional photos.  The company turned profitable in May and since then generated seven-digit positive EBIT figures. In July alone, more than 27 million users visited the website, resulting in a 2.6x growth in year-on-year bookings and more than €130 million of newly generated bookings that month. Holidu now has a team of more than 200 people. 18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Stemson Therapeutics Secures $7.5M in Seed Financing", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/stemson-therapeutics-secures-7-5m-in-seed-financing.html", "content": ", a San Diego, CA-based maker of a therapeutic solution to cure hair loss, raised $7.5m in seed financing.  The round was led by Allergan Aesthetics, an AbbVie Company, and impact investor Fortunis Capital. Stemson aims to restore human hair growth with a novel approach using the patient’s own cells to generate new hair follicles. The seed funding supports the preclinical development of Stemson’s Induced Pluripotent Stem Cell (iPSC) based technology, which is capable of producing the cell types required to initiate hair follicle growth.  The financing allows the company to expand its management team and R&D resources, while recent approval of a foundational patent provides stability surrounding the company’s efforts to develop its radical solution for hair growth. The additions of Meghan Samberg, Ph.D. as Vice President of R&D and Preclinical Development, and Cenk Sumen, Ph.D. as Chief Technology Officer, complement the work of Stemson’s cofounder and Chief Scientific Officer, Dr. Alexey Terskikh and the R&D team.  The company is led by Geoff Hamilton, cofounder and chief executive officer.  Stemson received approval in the United States of its cornerstone Human Induced Pluripotent Stem Cell (iPSC) method patent licensed exclusively from the Sanford Burnham Prebys Medical Discovery Institute. The patent covers a novel process developed by Dr. Terskikh to differentiate iPSC into dermal papilla cells, the cell type primarily responsible for controlling hair follicle generation and hair cycling. The patent secures foundational methods using iPSC cell therapy to grow hair. 18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Joint Academy Raises $23M in Series B Funding", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/joint-academy-raises-23m-in-series-b-funding.html", "content": ", a Malmo, Sweden-based digital health company tackling the increasing prevalence of chronic joint pain, raised $23M in Series B funding.  The round was led by international investment company Kinnevik with participation from existing investors Karl-Johan Persson (chairman of H&M) and Alfvén & Didrikson. The company, which has raised $34.2m to date, intends sto use the funds to accelerate growth in the U.S. and to further expand its offering throughout Europe.   Co-founded by CEO Jakob Dahlberg and his father and Chief Medical Officer Leif Dahlberg, Joint Academy is a clinical evidence-based digital treatment for chronic joint pain, which connects patients with licensed physical therapists. Since being founded in Malmo, Sweden in 2014, the company has treated 25,000 patients who suffer from chronic hip and knee pain by connecting them with licensed physical therapists through its app. Initially, a patient\nreceives an evaluation from one of the 400 physical therapists on the platform\nwho will continuously follow up on the treatment and answer any questions the\nuser may have. Each day, patients are given personalised exercises that are designed to reduce pain and adjust as the patient’s condition improves. Progress can be tracked from one week to the next, which boosts motivation and improves treatment results, while reminders keep them on-track. 18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Accenture to Acquire Salt Solutions", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/accenture-to-acquire-salt-solutions.html", "content": "Accenture (NYSE: ACN) is to acquire  , a Würzburg, Germany-based technology consultancy.  The amount of the deal –  whose completion is subject to customary closing conditions – was not disclosed.  Led by Maximilian Brandl, CEO, Salt implements and maintains IT systems for production, operations and logistics at leading German automotive, manufacturing, consumer goods and chemicals companies.  The company is a certified SAP Gold Partner and has additional offices in Berlin, Dresden, Düsseldorf, Munich and Stuttgart. The acquisition will help Accenture build cloud-based industrial internet of things (IoT) platforms that speed up and optimize clients’ production and logistics and enable them to reduce quality and waste issues along the entire supply chain. Salt Solutions will join  , which helps clients improve how they operate factories and plants. SALT Solutions brings a team of more than 500 highly skilled professionals with deep expertise in manufacturing and supply chains systems including, but not limited to, SAP manufacturing software.  SALT Solutions will be bolster Accenture’s digital manufacturing and operations capabilities, which Accenture has been growing through acquisitions in different markets. These include PLM Systems in Italy, Callisto Integration in Canada, Silveo in France and Enterprise System Partners in Ireland. It will also follow other acquisitions Accenture has made to strengthen Industry X in Germany, which include embedded software company ESR Labs, technology consultancy Zielpuls and strategic design consultancy designaffairs. 18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "NASDAQ: The Story Of Two Swedish iGaming Firms About To Merge", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/nasdaq-the-story-of-two-swedish-igaming-firms-about-to-merge.html", "content": "NetEnt and Evolution Gaming are two Swedish born\niGaming firms that are showing remarkable success. Both companies are trading\nin SEK on the Stockholm NASDAQ and Evolution Gaming is set to take NetEnt under\nits wing as it did eZugi Gaming. In one of the most competitive online industries in\nthe world, these two firms are currently in a head-to-head battle for market\nshare in the live dealer and virtual table gaming niche markets while NetEnt\nalso produces online video slots. Their games accept both cryptocurrency and fiat\ncurrency online betting and support multiple languages making them both global\nsensations in the online casino industry and fierce rivals.  However, that is all about to change in a deal said to\nbe worth €1.9 billion. Evolution Gaming is poised to buy all\nseries A and series B NetEnt shares on the  \nStockholm. The trade-off deal means NetEnt gets 0.1306 of every Evolution\nGaming share in exchange. The combination of the two firms will dominate the\niGaming industry as the two biggest names in the game will no longer be\ncompeting. It is a move that makes perfect sense because both companies are\nshowing success on the NASDAQ as we report below. Despite the competition, Evolution Gaming and NetEnt\nCasinos are still recording record revenues making them attractive investments.\nThey are the two largest live casino platform providers and are about to merge\nunder one company which will effectively blow the competition away. You find\nout  . Both firms lock horns in the live casino gaming\nenvironment and virtual table gaming arenas and their games are available at\nonline casinos around the globe.  Meanwhile, NetEnt also has another revenue stream coming\nfrom its vast collection of immensely popular online video slots. NetEnt’s\nventure in the video slots industry was one of the firm’s first endeavours into\nthe iGaming industry while Evolution is currently not in the business of slot\ndevelopment.  NetEnt is famous for its highly engaging progressive\njackpot slot games that can potentially pay out millions of Euros in prize\nmoney, while the firm also has over one hundred non-jackpot slots that come\nwith RTPs of up to ninety-nine per cent and high bet multipliers. The developer also releases at least two brand new\nslot games every month, keeping the firm’s brand name fresh in the minds of its\nslot loving followers. It is fair to say business is booming for NetEnt in\nthe slot industry despite competing with over one hundred slot developers in\nthis sphere while the live casino industry only has around twenty plus\ncompetitors with Evolution Gaming being NetEnt’s main competitor where both\nfirms are the leading platforms with Microgaming, Playtech, and Pragmatic Play\njust trailing. Over in the virtual table game genre of the iGaming\nindustry, Evolution Gaming is a new player in the market and has impressed with\nits fresh-looking VR style roulette, blackjack, and baccarat tables. While\nNetEnt designs virtual roulette, baccarat, and Texas Hold’em Pro table games.  This is once again another incredibly competitive\narena in the iGaming industry, with around forty software developers competing\nfor market share. Right now, games from both firms can be found in all\nthe world’s major iGaming countries such as the UK, Sweden, Germany, Canada,\nAustralia, New Zealand, and India. Impressively, Evolution Gaming is also penetrating the\nUS market, which is an extraordinary feat considering the multiple barriers to\nentry since the US government put in federal financial laws that restrict US\ncitizens from gambling online. However, state laws in place such as Delaware,\nNew Jersey, and Nevada open some doors for online casinos and Evolution Gaming\nis hot on the trail. These two firms are at the top of their game in every\nfield they compete in, and neither show any signs of slowing. This is reflected\nin their exciting SEK stock prices that continue to go from strength to\nstrength. Currently, the Evolution Gaming Group has over 181\nmillion shares floated and is listed under the ‘Travel and Leisure’ sector and\nhas 11,832 recorded trades while the trade volume is 833,522. Its impressive performance on the stock market over\nthe last 52 weeks has seen its stock rise from 185 to 701, and in 2020 each\nshare began at 269 and rose to 701. The iGaming brand’s major push began in 2019 when in\nJanuary shares were valued at 109 and slowly steamed rolled up to 269 over the year.\nIt is 2020 that then saw the firm’s share prices rise 160%. NetEnt has 206 million shares floated and is also\nlisted under the ‘Travel and Leisure’ sector. The number of trades on the\nNasdaq currently stands at 665 and the trade volume lists right now as 376,669. Its performance is equally as impressive as its live\ncasino platform rival, although shares are not as valuable. Its 52-week stats\nshow a rise from 15.3 to 90 and the same figures show for the firm’s 1-year\ntotal. NetEnt’s push in share price rises began way back in\n2013 after years of share price resistance between 10 and 12. From 2013 to\nmid-2016 shares steadily rose year on year to a high of 91 before dropping off\nto 15.3 by the end of 2019. 2020 is the return of NetEnt on the NASDAQ with a\nrise in the first 3 quarters to its current standing of 90. Currently, there are hundreds of competitors and new\nsoftware developers entering the market mainly under the wing of top iGaming\nsoftware firms such as Microgaming and Playtech.  For NetEnt’s video slot market this is not ideal, but\nits brand is still revered amongst slot fans mainly because NetEnt has been\naround since the beginning of time. Whether Evolution Gaming’s take over will\nrebrand NetEnt’s slots or continue with the world-famous NetEnt brand name\nlabelling the video slot’s division as ‘Evolution Gaming NetEnt Slots’ is not\npublic information at this time.  The virtual table gaming market is also seeing its\nfair share of new entrants and we are about to see existing brands and an\nincrease in new entrants in the live dealer sphere.  Whether the new competition affects iGaming companies\nfloated on stock markets remains to be seen.  However, with Evolution Gaming and NetEnt the two most\nused live dealer platforms in online casinos, it seems that this side of the\nbusiness is already locked up. Evolution Gaming also owns the eZugi live dealer\nplatform. With this in mind, it seems inevitable that the combination of both\nof these firms and their impressive NASDAQ performances makes Evolution Gaming\nshares an attractive investment. Adding to this, the iGaming industry is set for a huge\nrise in players and revenues. According to  ,\nin 2019 the industry was worth 58.9 billion and by 2023 it should rise to 92.9\nbillion. That is a formidable 57% rise which points to this market as the ideal\nsector for investment."},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Infarm Raises $170M in First Close of Series C Funding", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/infarm-raises-170m-in-first-close-of-series-c-funding.html", "content": ", a Berlin, Germany-based provider of cloud-connected farming facilities, raised $170M in the first close of its Series C funding.  The equity and debt round –  which is expected to reach over $200m – was led by impact investing firm LGT Lightstone with participation from Hanaco, Bonnier, Haniel, and Latitude, and supported by existing investors Atomico, TriplePoint Capital, Mons Capital and Astanor Ventures. The investment raise brings Infarm’s funding total to more than $300m to-date. The company intends to use the funds to deepen the regional and local penetration of its global farming network and complete development of its farms.  Founded in Berlin in 2013 by Osnat Michaeli and the brothers Erez and Guy Galonska, Infarm is advancing a new generation of vertical cloud-connected farms, capable of generating the crop-equivalent of acres of farmland and amplifying the diversity of produce currently available through vertical farming.  The farms are placed in various locations in the city, like supermarkets, restaurants and distribution centers, so that vegetables grow and are harvested close to the moment of purchase or consumption.  With a multinational team of 600 people globally, Infarm has partnered with more than 30 major food retailers including Albert Heijn, Aldi Süd, Amazon Fresh, Auchan, Casino, E.Leclerc, Edeka, Empire Company Ltd (Safeway, Sobeys, ThriftyFoods), Farmdrop, Intermarché, Irma, Kinokuniya, Kroger, Marks & Spencer, Metro, Migros, Selfridges and Selgros in Canada, Denmark, France, Germany, Japan, Luxembourg, the Netherlands, the United Kingdom, the United States and Switzerland, deployed more than 1000 farms in stores and distribution centres. 18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Treez Raises $13M in Series B Funding", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/treez-raises-13m-in-series-b-funding.html", "content": ", an Oakland, Calif.-based company focused on retail automation for the cannabis industry supply chain, closed a $13m Series B funding round.  The round was led by Intrinsic Capital Partners.  The new funding will be used to further accelerate expansion into legal state retailers for B2C and B2B commerce, as well as extend the company’s reach through APIs into best-of-breed tech stacks (ERP, CRM and other complementary systems).  Founded in 2016 by John Yang and Shareef El-Sissi, Treez  is an enterprise-grade business management platform serving the cannabis supply chain. The platform solution benefits brands and retailers, with point-of-sale (POS), integrated payments, grow and data software solutions. Included are analytics for real-time insights and industry cataloging technology that allows greater automation. 18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Lightspeed Venture Partners Launches Southeast Asia Operations", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/lightspeed-venture-partners-launches-southeast-asia-operations.html", "content": "Global venture capital firm   has launched its Southeast Asia operations.  Headquartered in Singapore, the firm will partner and support the region’s entrepreneurs building disruptive companies.  Lightspeed will deploy capital for its Southeast Asian investments from its global funds, having raised US$4 billion in 2020. In Southeast Asia as well, the firm is actively engaging with ventures right from their early stages, in sectors like commerce, fintech, edtech and SaaS among many others. Lightspeed has already invested in Grab, social commerce platform Chilibeli, B2B marketplace app Ula, enterprise artificial intelligence software provider NextBillion.ai as well as fulfilment and shipping gateway company Shipper. Additionally, many of the firm’s portfolio companies are scaling up business in Southeast Asia and have regional headquarters in Singapore – including Snap, OYO Rooms, Yellow Messenger and Darwinbox among others. Many ventures are also building multi-location businesses with engineering talent from India and other areas. Lightspeed will expand its Southeast Asian activities from its regional office in Singapore. The Southeast Asia team comprises: Over the last 20 years, Lightspeed has helped entrepreneurs in diverse industries scale into multi-billion-dollar companies, some of which are Snap (US), Nutanix (US), Pinduoduo (China), Man Bang group (China), Grab (Asia), OYO Rooms (India), Udaan (India) and Byju’s (India). The firm has engaged with each of its investments to enable its founders to succeed – leveraging its global portfolio network, customer introductions, talent and marketing support and growth capital.  18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Imagine Impact Closes Series A Financing", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/imagine-impact-closes-series-a-financing.html", "content": ", a Los Angeles, CA-based content accelerator and online marketplace startup founded by Brian Grazer and Ron Howard, closed its Series A financing round.  The round was led by Benchmark and Bill Gurley, longtime Benchmark partner, will join the board.  The investment establishes Imagine Impact as a new, stand-alone company, Impact Creative Systems, led by Impact CEO Tyler Mitchell, and will support the startup’s continuing expansion in technology. Impact is launching   this fall – an online marketplace and professional networking platform designed specifically for entertainment industry professionals to help bring efficiency and access to Hollywood.  Founded in September 2018, Imagine Impact discovers, cultivates and empowers creative storytellers around the world through a curation and development system that helps them create their best work. Impact has also launched  , an online content marketplace and social networking platform designed for entertainment industry professionals. Imagine Impact has built a network of 30,000 writers from over 80 countries and developed 72 projects, 25 of which have been set up 24 at major studios throughout the industry, including: Netflix, Sony, Amblin, Legendary, Village Roadshow, Sony and more; Creators have been signed by major agencies and management companies, including CAA, WME, UTA, Verve, Anonymous Content, Lit Management, Management 360, 3Arts and more. Impact’s Creative Network is used by industry producers and executives from over 300 companies, including ABC, Amazon, CBS, Disney, HBO, Netflix, NBC, Paramount, Universal, and Warner Brothers. Impact also recently launched a podcast, which is an outgrowth of its speaker series that accompanies the accelerator.  “IMPACT: The Podcast” features conversations with world renowned artists such as: Peter Berg (Friday Night Lights, Lone Survivor); Issa Rae (Insecure); Judd Apatow (40 Year Old Virgin, Trainwreck): The RZA (Wu-Tang: An American Saga): Dave Burd aka Lil Dicky (Dave): Jeff Schaffer (Curb Your Enthusiasm); Saladin Patterson (The Last O.G.); Academy Award winners Frances McDormand (Three Billboards, Fargo), Damien Chazelle (La La Land, Whiplash)and Akiva Goldsman (A Beautiful Mind, Cinderella Man), and many more. The Series A follows Impact’s recent announcements, including: a deal with Netflix utilizing Impact’s proprietary systems to source and develop original feature films from writers around the world across four specific genres for Netflix; as well as the recent launch of Impact Australia, its first international accelerator which was financed by Screen Australia and Film Victoria, along with the state and territory screen agencies. 18/09/2020"},
{"site": "FINSMES : Real Time VC & Private Equity Deals and News", "headlines": "Tonal Raises $110M in Funding", "dates": "September 18, 2020", "links": "https://www.finsmes.com/2020/09/tonal-raises-110m-in-funding.html", "content": ", a San Francisco, CA-based personal training platform that combines proprietary digital weight, artificial intelligence, and expert-led coaching, raised $110M in funding.  Backers included the Growth Fund of returning investor L Catterton, as well as returning investors Sapphire Sport, Shasta Ventures, Mayfield, Evolution Media, and THVC. New investors include Delta-v Capital, the Amazon Alexa Fund, and Mousse Partners. Additional strategic investors include Stephen Curry, Paul George, Michelle Wie, Rudy Gay, Kyle Rudolph and Bobby Wagner. Previous investors include Serena Williams, Klay Thompson, and Tony Gonzalez.  The company intends to use the funds to accelerate marketing initiatives and scale its supply chain and logistics to meet demand, while also rolling out new software-driven product innovations and a wider breadth of content. In addition, Tonal is researching applications of digital strength training with Mayo Clinic. Led by Aly Orady, CEO, Tonal is an intelligent home gym and personalized company providing people with the equipment, technology, and guidance to reach their fitness goals. By using a proprietary digital weight system instead of metal weights, Tonal can generate 200 pounds of resistance and replicate every machine in the weight room with a fraction of the equipment. It is used by hundreds of professional athletes and sports franchises.  The company has a number of partnerships including Mayo Clinic, the Four Seasons Palo Alto, Andaz Scottsdale Resort & Bungalows, Waldorf Astoria Boca Raton Resort and Club, as well as all Proper Hotel and Residences locations.  18/09/2020"}
]