[
{"site": "Private Equity Wire", "headlines": "Paladin Capital hires CEO of UK’s national cybersecurity centre", "dates": "09/20/2020", "links": "https://www.privateequitywire.co.uk/2020/09/18/289828/paladin-capital-hires-ceo-uks-national-cybersecurity-centre", "content": "Paladin Capital is at the vanguard of cybersecurity investing, having invested in close to 50 cyber and advanced technology companies, including Digital Shadows and Secure Code Warrior. It regards itself as a multi-stage investor and focuses on backing early stage companies that are developing products and services that defend, monitor and secure our shared critical, digital infrastructure. Commenting on Ciaran’s appointment, Michael Steed, Founder and Managing Partner, Paladin Capital, said: “Ciaran Martin is an exceptional talent in the cyber sphere and we’re profoundly pleased to have him join the Paladin team. His understanding of the ever-evolving threat landscape and knowledge of the technologies required to meet those challenges will help us assess potential investments and support our portfolio companies in their growth. “At Paladin we focus on companies that have a “dual lens”, that is, they provide services to government and commercial customers. Ciaran’s experience working across the public and private sectors to develop cyber solutions will be invaluable for the companies we back.” Speaking with   over email, Mike Steed added that Ciaran’s appointment underscored Paladin’s investment strategy of “broadening and sustaining our information advantage that drives our global cyber investing”.  “To be a good cyber investor focusing on digital resilience of our critical infrastructure, you must have global leaders helping to form the themes and thesis that will identify the answers to the solutions need to protect and defend our society. Ciaran Martin is just such a global leader,” he added. Ciaran will be based in Paladin’s European headquarters in the UK and will help grow Paladin’s presence in Europe’s cybersecurity early stage market. He will also be part of Paladin’s global Strategic Advisory Board, advising the company on threats, trends, risks and opportunities in cybersecurity for businesses and governments. This important role is in addition to Ciaran’s position as Professor of Practice at the Blavatnik School of Government at the University of Oxford. “I am delighted to be working with the Paladin team,” said Martin. “I learned in Government that whether it’s in the UK, Europe, the US or globally, the common cyber threats we face can only be solved if there is a strong, innovative private sector taking care of huge swathes of the problem. That presents enormous economic opportunities for talented technologists and entrepreneurs and I’m looking forward to being part of a venture capital team helping them to succeed.\""},
{"site": "Private Equity Wire", "headlines": "Stemson Therapeutics Secures GBP6m in seed financing", "dates": "09/20/2020", "links": "https://www.privateequitywire.co.uk/2020/09/17/289775/stemson-therapeutics-secures-gbp6m-seed-financing", "content": "Stemson aims to restore human hair growth with a novel approach using the patient’s own cells to generate new hair follicles. Allergan Aesthetics is a world leading medical aesthetics company. Fortunis Capital, a London-based venture capital firm is committed to continuing support of Stemson’s regenerative cell therapy to treat hair loss. Fortunis Capital’s new Impact Fund intends to invest in companies, such as Stemson, which offer significant social or environmental benefit.  “Stemson’s novel cell therapy approach to treat hair loss has game-changing potential. Their experienced management team is poised to elevate its proprietary regenerative cell therapy method as it begins the next phase of its preclinical programme,” says Sir Andrew Ross, Director of Investments at Fortunis Capital. “Fortunis Capital is committed to supporting companies that are creating innovative solutions with worldwide social or environmental benefit and we believe that Stemson has the team, technology and the tools in place to develop a therapy capable of solving the hair loss problem for millions of people in need.” The seed funding supports the preclinical development of Stemson’s Induced Pluripotent Stem Cell (iPSC) based technology which is capable of producing the cell types required to initiate hair follicle growth.  Globally, hundreds of millions of men and women suffer from various forms of hair loss, and no solution today is capable of generating a new supply of follicles for patients in need.   “Allergan Aesthetics’ research and development efforts are focused on products and technologies that drive the advancement of aesthetics medicine. Hair loss is a significant unmet medical need for millions of men and women, and Stemson Therapeutics’ efforts to develop novel methods to regrow hair is an opportunity to make a difference in this area,” says Yehia Hashad, MD Senior Vice President, Research and Development, Allergan Aesthetics. The initial seed financing allows Stemson to expand its management team and R&D resources, while recent approval of a foundational patent provides stability surrounding the Company’s efforts to develop its radical solution for hair growth.  The additions of Meghan Samberg, PhD as Vice President of R&D and Preclinical Development and Cenk Sumen, PhD as Chief Technology Officer complement the work of Stemson’s cofounder and Chief Scientific Officer, Dr Alexey Terskikh and the R&D team. Stemson received approval in the United States of its cornerstone Human Induced Pluripotent Stem Cell (iPSC) method patent licensed exclusively from the Sanford Burnham Prebys Medical Discovery Institute. The patent covers a novel process developed by Dr Terskikh to differentiate iPSC into dermal papilla cells, the cell type primarily responsible for controlling hair follicle generation and hair cycling. The patent secures foundational methods using iPSC cell therapy to grow hair. “Stemson has established the biological and technical building blocks which are needed to solve the problem of hair loss. A truly curative solution is now feasible, and we have built a world class team to deliver a therapy for the millions of hair loss sufferers across the world,” says Geoff Hamilton, cofounder and chief executive officer of Stemson Therapeutics. “We are grateful for support from Allergan Aesthetics and Fortunis Capital, and we look forward to expanding our base of investors as we move toward our first human clinical trial.”"},
{"site": "Private Equity Wire", "headlines": "Stirling Square Capital Partners' fourth fund teams with TA Associates to invest in Docu Nordic", "dates": "09/20/2020", "links": "https://www.privateequitywire.co.uk/2020/09/18/289814/stirling-square-capital-partners-fourth-fund-teams-ta-associates-invest-docu", "content": "TA Associates will acquire a significant minority stake in the Company from Stirling Square’s Third Fund alongside Stirling Square’s Fourth Fund, which becomes the majority shareholder in DOCU Nordic. Headquartered in Ljusdal, Sweden, DOCU Nordic is the leading provider of business intelligence and data analytics services within the construction, real estate and healthcare markets in Scandinavia, Central Europe and Iberia. During Stirling Square’s Third Fund’s ownership, DOCU Nordic substantially developed its product offerings and capabilities while expanding its geographic reach. The Company recently announced the acquisition of Vortal in Portugal, which will add strategic e-tendering capabilities and a presence in Iberia. The new investment is the latest step in DOCU Nordic’s aim to create the leading construction technology and construction management eco-system in Europe, with significant opportunity for future buy-and-build activity. Henrik Lif, Partner of Stirling Square, says: “We believe that DOCU Nordic is an outstanding business that provides business critical and high-value services to a broad customer base. We are delighted to continue our investment journey with the Company in partnership with TA Associates. DOCU Nordic has demonstrated industry leading innovation in the construction, real estate and healthcare sectors. With the recent acquisition of Vortal in Portugal, the Company takes a further step geographically with the leading public e-tendering platform in Southern Europe. We look forward to continuing our work with senior management on organic growth and buy-and-build opportunities across Europe.” Naveen Wadhera, Managing Director of TA Associates, says: “Given our focus on partnering with market leading, profitable and growing businesses, DOCU Nordic offers a compelling investment opportunity for TA. We see particular opportunity to help accelerate the Company’s growth and to expand both product offerings and geographic reach through accretive acquisitions. We are excited to partner with Stirling Square and DOCU Nordic’s management team to help build additional value for the Company.” Stefan Lindqvist, CEO of DOCU Nordic, adds: “We are delighted to have the opportunity to further build on the past three years of partnership with Stirling Square, and we welcome TA Associates, an experienced global investor in the technology sector, as a new partner. We look forward to working closely with both owners as we open a new chapter in DOCU Nordic’s success story.” Henrik Lif, Ben Hopper Raphael Mukomilow of Stirling Square and Naveen Wadhera and Max Cancre of TA Associates will serve on the DOCU Nordic Board of Directors. \n "},
{"site": "Private Equity Wire", "headlines": "Questa Capital closes USD348m Fund II to invest in transformational healthcare companies", "dates": "09/20/2020", "links": "https://www.privateequitywire.co.uk/2020/09/18/289822/questa-capital-closes-usd348m-fund-ii-invest-transformational-healthcare", "content": "The firm's second fund will invest selectively in later stage companies in healthcare services, technology and medical devices with significant growth potential. The firm has a proven team with a collective 70 years of experience investing in and building growth stage companies.   The Fund was oversubscribed at its hard cap, securing commitments from a diversified blue-chip investor base comprised of leading endowments, foundations, family offices, consultants, pension plans and fund-of-funds. Questa Founder and Managing Partner Ryan Drant says: \"Despite the challenges of COVID-19 we have been honoured with the investor response for our second fund, which exceeded our expectations. We are both grateful for the strong interest and additional investment from our existing investors, and pleased to be starting long-term relationships with a small group of exceptional new limited partners. We look forward to continuing to build differentiated and high-growth healthcare companies in close collaboration with strong management teams. Questa will continue to partner with companies that share our vision and passion to improve clinical outcomes, efficiency, safety, and the patient experience to help address critical challenges in our healthcare system.\" Questa Capital is an active and collaborative partner for the companies in which it invests. The Questa team brings deep sector expertise in healthcare services, technology and medical devices, and a deep network and industry experience to help guide portfolio companies toward leading market positions and accelerated growth. Current and exited companies within the Questa portfolio include Dispatch Health, EPIX Therapeutics (acquired by Medtronic in early 2019), and Medrio among others. Questa closed its inaugural fund in 2018 with USD199 million of capital commitments. \"The year 2020 has offered a challenging and unique set of perspectives concerning the changing US healthcare landscape. As DispatchHealth continues to grow, Questa Capital has been an exceptional partner for our company during these times as we continue to expand our team and execute on our market expansion,\" says Mark Prather MD, MBA, CEO and co-founder of DispatchHealth. \"We are thrilled for their success in raising Fund II and look forward to their and our continued achievements, working together.\" Acalyx Advisors served as exclusive placement agent and Gunderson Dettmer provided legal counsel to Questa."},
{"site": "Private Equity Wire", "headlines": "How has the ‘Amazon effect’ changed tech-adoption in supply chains?", "dates": "09/20/2020", "links": "https://www.privateequitywire.co.uk/2020/09/17/289787/how-has-amazon-effect-changed-tech-adoption-supply-chains", "content": "“The Amazon effect has changed consumer needs of wanting products delivered in a day or two versus what five years ago would be a week,” commented Dolan. Other catalysts include supply chain and delivery mechanisms across industries requiring real time speed and visibility, location tracking, digitisation and minimum human to human interaction requirements during the current Covid-19 crisis. During these unprecedented times, software and technology have enabled supply chains to reroute services from concentrated verticals such as hospitality and hotels to hospitals and pharmaceuticals. Dolan also emphasises the fact that supply chains of the transportation industry will witness a changing capex environment accompanied by tighter margins in the future. There will also be an increased focus on optimising efficiency and maintenance of existing capex inventory using software and technology, rather than purchasing a replacement. This is significant due to the “ripple effect” which leverages the high interconnectedness of mobility in supply chains, as, in Dolan's view,  a delay or breakdown in one segment of the supply chain would have a multi-field impact across the business. He also believes that investors in the transportation industry seem to benefit from a 'flight to quality’ trend as they are currently witnessing good underlying trends. However, they are likely to operate from a level of familiarity when it comes to deal prospecting and transaction management, as it is difficult to forge new relationships during the current home-working environment. Overall, Dolan is cautiously optimistic about the future, saying: “The pandemic will have a positive effect on the industry as it will improve and increase technology to solve many complexities.”"},
{"site": "Private Equity Wire", "headlines": "Blackstone invests alongside Fairfax in USD500m Ki launch", "dates": "09/20/2020", "links": "https://www.privateequitywire.co.uk/2020/09/17/289773/blackstone-invests-alongside-fairfax-usd500m-ki-launch", "content": "The capital commitment will fund Ki’s expansion as it launches in Q4 2020, enabling the business to grow rapidly to significant scale.   \nKi is a newly formed follow-only digital business which will write its’ first risk incepting in January 2021. It will underwrite using an algorithm-driven approach and offer instant follow capacity through its proprietary digital platform. Ki will write a broad range of specialty business following selected leaders in the Lloyd’s market, including Brit. \n  \nQasim Abbas, Senior Managing Director at Blackstone, says: “Matthew, Mark and the rest of the Ki team have created a unique opportunity in Lloyd’s to revolutionise the market and we are excited to be a part of this, in partnership with Fairfax. Ki’s first-of-its-kind digital model will deliver a unique advantage to its’ business partners which we believe will enable it to build to significant scale, while its algorithmically-driven approach represents an important evolution in the portfolio management of specialty risks.” \n  \nBurkhard Keese, CFO at Lloyd’s of London, says: “We are delighted to see Blackstone entering Lloyd’s at this key moment in our modernisation, illustrating the appeal of our market.  Ki is fully aligned to the Lloyd’s Blueprint, driving the adoption of new technology to deliver a more competitive market, and we wish the team success as it launches later this year.” \n  \nMatthew Wilson, CEO of Brit and Chairman of Ki, says: “Our Partnership with Fairfax and Blackstone on the launch of Ki will allow the business to reach its full potential with significant committed capital.  Blackstone has a phenomenal track record and is entering the Lloyd’s market at a pivotal moment, with increased acceptance of digital models and a flight to quality.” \n  \nMark Allan, CEO of Ki and Group CFO of Brit, says: “Securing support from Blackstone, one of the world’s leading investment firms, is a significant statement of confidence in Ki and the vision we have set out. Blackstone’s commitment to Ki completes our world-class group of partners with Fairfax, Brit, Google Cloud and UCL already supporting the business.  With our investors, we have the financial firepower to rapidly scale the business and support our plan to provide a truly differentiated offering to brokers and clients.” \n  \nThe creation of Ki was first announced in May 2020. Ki will aim to significantly reduce the amount of time taken for brokers to place their follow capacity. Ki’s algorithm, developed with support from University College London, will evaluate Lloyd’s policies and automatically quote for business through an always available digital platform, built by Google Cloud and accessed directly by brokers. \n "},
{"site": "Private Equity Wire", "headlines": "EFG Hermes' Vortex Energy sells controlling stake in 365MW UK solar portfolio to TNB valuing the portfolio at cGBP500m", "dates": "09/20/2020", "links": "https://www.privateequitywire.co.uk/2020/09/17/289774/efg-hermes-vortex-energy-sells-controlling-stake-365mw-uk-solar-portfolio-tnb", "content": "The stake was sold to TNB International Sdn Bhd, a wholly owned subsidiary of Tenaga Nasional Berhad (TNB), an existing shareholder in the business and one of South East Asia’s largest utilities with an installed capacity of c15GWs globally. Vortex III is one of the largest standalone portfolios in the UK, with an average asset age of 6 years, PPAs with major European energy companies and utilities, an attractive ROC regime and a long-term debt package from major lenders including Santander, RBS and ING. The portfolio achieved an EBITDA of cGBP39 million in 2019 with an 84 per cent EBITDA margin, exceeding its budget and providing attractive cash yields to its shareholders. It continues to meet its targets in 2020, despite the global challenges. Karim Moussa, Head of Private Equity and Asset Management, at EFG Hermes says: “This is a major milestone for Vortex. The exit of Vortex III delivered a 1.5x cash on cash multiple to our investors and an IRR of c14 per cent. We continue to demonstrate our ability to pursue the full cycle of raising capital, investing strategically and exiting major renewable energy portfolios. Since launching Vortex in 2015, we have combined net 822MW of premium assets while investing more than EUR1.3 billion in the sector in developed markets. We have been consistently delivering attractive returns to our shareholders and partners by aggregating and enhancing assets and then selling portfolios to strategic long-term owners of renewable energy assets. This is the second major exit following the disposal of our 49 per cent stake in a 1GW wind portfolio to funds managed by JP Morgan last year.” Bakr Abdel-Wahab, Head of Energy, at EFG Hermes Private Equity, says: “This transaction demonstrates Beaufort’s skills as a leading investment and asset manager of large scale portfolios and businesses. Since acquiring the UK assets, we have improved their performance and capital structure via a major refinancing; revamping all key portfolio agreements, partnering with Lightsource BP and establishing a strong London based asset management team. This active management strategy has generally enabled us to return to our investor across our three Vortex Energy platforms since inception, an average net annual cash yield of 5 per cent, cash-on-cash multiple of 1.4x and IRR of 13 per cent. We look forward to continue growing Vortex Energy’s footprint and investing in energy transition businesses and portfolios globally over the coming period.” The Beaufort team is currently planning to establish Vortex IV, a renewable energy platform that will target global generation, storage, distribution and technology businesses.  Moussa says: “We are excited about future global opportunities in renewables and the wider clean energy space, we shall aim to commence our fundraising efforts by the end of 2020, with anchor investors already showing increased interest in our next endeavor Vortex IV .”"},
{"site": "Private Equity Wire", "headlines": "Kbox Global secures GBP12m from Balderton Capital", "dates": "09/20/2020", "links": "https://www.privateequitywire.co.uk/2020/09/17/289772/kbox-global-secures-gbp12m-balderton-capital", "content": "The Kbox model revisits the traditional economics of food delivery by utilising capacity in existing commercial kitchens. Kbox’s technology and menu portfolio mean kitchen owners, from pubs, hotels and restaurants to supermarkets, can establish an agile new revenue stream, that reflects the demographics and taste trends of their area, within days, for no upfront fee, and no additional investment in bricks and mortar. The company has seen exponential growth in the last quarter since it secured seed funding of GBP5 million from Hoxton Ventures earlier this year. With kitchens in London, Manchester, Liverpool, Glasgow, Edinburgh, and Brighton, Kbox is on course for 2000 operational kitchens in the UK before the end of 2021. An international rollout of the model is also underway with franchise agreements in Australia and India already signed and launching this month with a further eight countries to be launched next year. \n  \nThe food delivery market has grown 40 per cent in five years in the UK and shows no sign of slowing down in the wake of the pandemic. \n  \nThe Balderton investment will be used to accelerate Kbox’s UK growth plans as well as support planned international expansion and the establishment of a US base early next year. Salima Vellani, Kbox founder and serial restaurateur, armed with a track record of expanding concepts across international markets and having foreseen the rise of the delivery-first era, is now seizing on it for the benefit of the whole hospitality ecosystem. \n  \nSalima Vellani, Kbox founder and CEO, says: “These are challenging times for anyone working in hospitality and income diversification is a powerful tool to boost revenues. I’m thrilled that venues from pubs, restaurants and hotels to casinos and supermarkets are embracing the delivery first era, by firing up their kitchens with Kbox. “To have Balderton’s backing means we can respond to the global demand for a shakeup of the old economics, for the benefit of food providers, commercial kitchen owners and consumers.” Daniel Waterhouse, Partner at Balderton Capital, adds: “Salima and the team have joined the dots between rapidly increasing consumer demand for delivery meals, ever-changing food preferences and under-utilised kitchen assets in a challenged hospitality sector. They have melded software and data science into a next-generation franchising model that can be deployed quickly to thousands of kitchens around the world. We are delighted to be joining them on this journey.”"},
{"site": "Private Equity Wire", "headlines": "Antares Capital holds final close of inaugural senior loan fund", "dates": "09/20/2020", "links": "https://www.privateequitywire.co.uk/2020/09/17/289771/antares-capital-holds-final-close-inaugural-senior-loan-fund", "content": "The fund, which launched in December 2019, closed on 14 September with approximately USD3 billion of asset purchasing power, exceeding its initial target of USD1.5 billion. Capital was raised across a diversified set of institutional investors. The investment objective of the SLF is to build a diverse portfolio of sponsor-backed senior secured loans to US and Canadian borrowers. Investors in the fund are primarily public and private pensions, insurance companies, asset managers and banks located predominantly in the US, Canada, Asia and the Middle East. “The closing of our inaugural fund is a significant milestone in continuing to diversify our investor base, and the ability to do so during the current market environment is a clear testament to the strength of the Antares brand,” says Vivek Mathew, senior managing director and head of asset management. “Investors appreciate that Antares’ market position allows us to be highly selective in the opportunities in which we invest. Also, Antares has implemented a variety of measures to demonstrate alignment of interests with our investors, and ultimately when markets turn, we have a track record of strong performance through market cycles.” “Covid-19 has been a stress test for our asset class, and while the story is not fully written yet, it appears that middle market private debt will perform well,” says David Brackett, CEO of Antares. “As a result, we anticipate further growth in our asset management platform. As a firm we recently recognised the five-year anniversary of our partnership with CPPIB Credit Investments Inc. During this time we are proud to have continued to build upon our industry-leading platform targeting private equity-owned middle market companies.” Antares Capital Advisers was advised by a team from Ropes & Gray led by asset management partner Peter Laybourn."},
{"site": "Private Equity Wire", "headlines": "GCV secures GBP1m in growth capital", "dates": "09/20/2020", "links": "https://www.privateequitywire.co.uk/2020/09/17/289776/gcv-secures-gbp1m-growth-capital", "content": "GCV has now opened up the investment round to new private investors via its online investment platform - growthfunders.com Investment from the current round will enable GCV to support 30 high-growth start-ups and create hundreds of new tech jobs within the North East through its venture builder unit, G-Labs. It will also enable GCV to increase internal headcount from 22 to 40 in the next 12-24 months. The funding announcement comes as Britain looks to the tech industry to kick-start a post-COVID economic recovery, after UK GDP fell by a record 20.4% in the three months to June 2020. Investments in the UK tech sector soared to a record GBP10.1 billion (USD13.2 billion) in 2019, according to trade body Tech Nation – a GBP3.1 billion increase on 2018 figures – and the industry is widely regarded as a key driver of future job creation and economic growth.   GCV is very much immersed in this important sector, having facilitated GBP45 million of investment in high-growth tech businesses – including digital lenders Atom Bank and B-North, and employee engagement platform Hive HR – and the creation of more than 600 new jobs in the past five years.  Craig Peterson, co-founder and chief operating officer at GCV, says: “Over the past five years we have been on a mission to support entrepreneurs and innovators to build and launch high-growth businesses that transform industries. “The fundraise will not only increase our capacity with further quality hires and expand our venture builder arm but in turn will enable the creation and scaling of the UK’s next wave of innovative tech start-ups. “As consumers and businesses are relying more on technology as a result of Covid-19, we feel this investment comes at the right time to combine capital and intensive support to build better, more sustainable businesses.” GCV has evolved rapidly since its inception in 2015. The company started life predominantly as a fintech company, developing and operating online investment platforms focused on alternative investments. Formally launching their first platform GrowthFunders.com in 2015, the company has since built an extensive private investor network across the North of England.  The network has backed high-profile businesses including UK challenger banks B-North and Atom Bank, as well as high-growth tech start-ups such as employee engagement platform Hive.HR and global intelligence and risk management provider, Intelligence Fusion. These businesses are using technology to transform their respective industries and between them have already created more than 600 jobs across the North East of England. GCV operates across three core business units – a private investor network, a specialist fintech software division and an innovation lab – all working together to drive growth, create value and deliver impact. The private investor network, G-Ventures,  brings together an online and offline investor network of experienced private investors and institutional investors to co-invest in growth-focussed investment opportunities. Providing investment opportunities across three core asset classes of venture capital, property and private equity, tax-efficient structures are utilised where possible including the Enterprise Investment Scheme (EIS) and Seed Enterprise Investment Scheme (SEIS) to take advantage of generous tax reliefs. GCV originates, structures, distributes and monitors these investments through its online co-investment and reporting platforms, which have been developed by the fintech software development division of the business (Quva).  GCV’s innovation and venture builder unit, G-Labs, invests capital, knowledge, experience, ideas and infrastructure to help tech entrepreneurs incubate business opportunities in high-growth sectors. Taking their ideas from concept to launch, scale, maturity and exit, this approach also provides the G-Ventures Investor Network with access to well structured, high-quality investment opportunities where investors and founders interests are fully aligned. The latest addition to the GCV business divisions is fintech software, Quva.  Quva designs, builds and operates online investment and reporting platforms aimed at streamlining the overall investment process and providing an end-to-end solution for investment managers and investor clients.  As a platform-as-a-service solution for investment firms and asset managers in the alternative investment sector, Quva has the potential to carve out a niche within this sector and create significant enterprise value as a standalone business unit. Peterson says: “Through our three business divisions we’ve developed a powerful approach to creating, launching and scaling high-growth businesses. We have the capability to support the start-up and expansion of several ventures that have the capacity to add real value to the UK’s tech industry. This sector will be vitally important to the UK as the economy tries to recover from the devastating impact of the coronavirus. “Our aim now is to invest in and support exciting new projects that can build, launch and scale businesses, creating much-needed jobs at a time when employment is falling due to Covid-19.” \n "}
]